---
kind: type
id: T:Autodesk.Revit.DB.Visual.Checker
source: html/ff4ecb34-6fef-402a-5cee-c7937974b8d2.htm
---
# Autodesk.Revit.DB.Visual.Checker

A static class that provides access to the property names that appear in the Checker visual asset schema.

## Syntax (C#)
```csharp
public static class Checker
```